newwms_gift/src/Documents/итWMSОтгрузка/итWMSОтгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSОтгрузка</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <basedOn>Document.Маршрутизация</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузочныеВорота</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наборка</name>
      <type>
        <types>DocumentRef.итWMSНаборка</types>
      </type>
    </attributes>
    <attributes>
      <name>ОчередностьПогрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>итОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.итWMSНаборка</types>
        <types>DocumentRef.Маршрутизация</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSОтгрузка/ManagerModule.bsl
// Процедура - Получить краткую информацию отгрузки
//
// Параметры:
//  Ссылка			 - ДокументСсылка.итWMSОтгрузка	- ссылка на документ отгрузки 
//  СтруктураДанных	 - Структура - структура для заполнения 
//
Процедура  ПолучитьКраткуюИнформациюОтгрузки(Ссылка,СтруктураДанных) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSОтгрузкаТовары.Номенклатура,
		|	итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSОтгрузкаТовары.Количество КАК Количество,
		|	итWMSОтгрузкаТовары.Количество / ВЫБОР
		|		КОГДА ЕСТЬNULL(итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1)
		|	КОНЕЦ КАК КоличествоМест,
		|	итWMSОтгрузкаТовары.Ссылка КАК Ссылка,
		|	итWMSОтгрузкаТовары.Наборка КАК Наборка
		|ИЗ
		|	Документ.итWMSОтгрузка.Товары КАК итWMSОтгрузкаТовары
		|ГДЕ
		|	итWMSОтгрузкаТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоМест)
		|ПО
		|	Ссылка,
		|	Наборка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		СтруктураДанных.Вставить("КоличествоВсего",ВыборкаСсылка.Количество);	
		СтруктураДанных.Вставить("КоличествоМестВсего",ВыборкаСсылка.КоличествоМест);
		ВыборкаНаборка = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Счетчик=0;
		Пока ВыборкаНаборка.Следующий() Цикл
		СтруктураДанныхНаборки=новый Структура;
		СтруктураДанныхНаборки.Вставить("ИдентификаторНаборки",ВыборкаНаборка.Наборка.УникальныйИдентификатор());
		СтруктураДанныхНаборки.Вставить("КоличествоВсего",ВыборкаНаборка.Количество);	
		СтруктураДанныхНаборки.Вставить("КоличествоМестВсего",ВыборкаНаборка.КоличествоМест);
		СтруктураДанных.Вставить("Наборка"+Строка(Счетчик),СтруктураДанныхНаборки);	
		Счетчик=Счетчик+1;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ВнестиИзменениеДанныхТСДВДокумент(Документ) Экспорт 
	итWMSОбработчикДанныхОтгрузки.ВнестиИзмененияВДокументОтгрузки(Документ);
	КонецПроцедуры
